In [1]:
#import MongoClient
from pymongo import MongoClient

In [2]:
# pprint library is used to make the output look more pretty
from pprint import pprint

In [13]:
#Provide details of the database and connect
url="mongodb://localhost:27017/"
client=MongoClient(url)
db=client['Organizer']

In [16]:
#Drop collections since I need to recreate them but otherwise would not need this section
db.Student.drop()
db.City.drop()
db.Country.drop()
db.Courses.drop()
print("Collections dropped successfully")

Collections dropped successfully

In [23]:
#create collections
collection=db.Student

In [24]:
#Add records to the collection Student
db.Student.insert_one({"First_Name":"Judy","Last_Name":"Kimeu","Email":"judykimeu10@gmail.com","Cellphone":"0205154500","Physical_Address":"Meru","Gender":"Female", "City_Code":"1", "Country_Code":"1", "CourseID":"2", "StudentID":"1"})
db.Student.insert_one({"First_Name":"Eric","Last_Name":"Lagat","Email":"lagateric@gmail.com","Cellphone":"0205155500","Physical_Address":"Baringo","Gender":"Male", "City_Code":"1", "Country_Code":"1", "CourseID":"3", "StudentID":"2"})
db.Student.insert_one({"First_Name":"Henry","Last_Name":"Taute","Email":"taute@yahoo.com","Cellphone":"0205156500","Physical_Address":"Homabay","Gender":"Male", "City_Code":"2", "Country_Code":"2", "CourseID":"2", "StudentID":"3"})
db.Student.insert_one({"First_Name":"Maurine","Last_Name":"Njoki","Email":"njoki_maurine@hotmail.com","Cellphone":"0205157500","Physical_Address":"Nairobi","Gender":"Female", "City_Code":"3", "Country_Code":"3", "CourseID":"1", "StudentID":"4"})
db.Student.insert_one({"First_Name":"Fatme","Last_Name":"Gatheru","Email":"fatme_gatheru@yahoo.com","Cellphone":"0205158500","Physical_Address":"Meru","Gender":"Female", "City_Code":"3", "Country_Code":"3", "CourseID":"4", "StudentID":"5"})
print("Records saved successfully")

Records saved successfully

In [25]:
#Retrieve the records
result=db.Student.find()
for row in result:
    pprint (row)

{'Cellphone': '0205154500',
 'City_Code': '1',
 'Country_Code': '1',
 'CourseID': '2',
 'Email': 'judykimeu10@gmail.com',
 'First_Name': 'Judy',
 'Gender': 'Female',
 'Last_Name': 'Kimeu',
 'Physical_Address': 'Meru',
 'StudentID': '1',
 '_id': ObjectId('611e5a4e92c2728916f8fb35')}
{'Cellphone': '0205155500',
 'City_Code': '1',
 'Country_Code': '1',
 'CourseID': '3',
 'Email': 'lagateric@gmail.com',
 'First_Name': 'Eric',
 'Gender': 'Male',
 'Last_Name': 'Lagat',
 'Physical_Address': 'Baringo',
 'StudentID': '2',
 '_id': ObjectId('611e5a4e92c2728916f8fb36')}
{'Cellphone': '0205156500',
 'City_Code': '2',
 'Country_Code': '2',
 'CourseID': '2',
 'Email': 'taute@yahoo.com',
 'First_Name': 'Henry',
 'Gender': 'Male',
 'Last_Name': 'Taute',
 'Physical_Address': 'Homabay',
 'StudentID': '3',
 '_id': ObjectId('611e5a4e92c2728916f8fb37')}
{'Cellphone': '0205157500',
 'City_Code': '3',
 'Country_Code': '3',
 'CourseID': '1',
 'Email': 'njoki_maurine@hotmail.com',
 'First_Name': 'Maurine',
 'Gender': 'Female',
 'Last_Name': 'Njoki',
 'Physical_Address': 'Nairobi',
 'StudentID': '4',
 '_id': ObjectId('611e5a4e92c2728916f8fb38')}
{'Cellphone': '0205158500',
 'City_Code': '3',
 'Country_Code': '3',
 'CourseID': '4',
 'Email': 'fatme_gatheru@yahoo.com',
 'First_Name': 'Fatme',
 'Gender': 'Female',
 'Last_Name': 'Gatheru',
 'Physical_Address': 'Meru',
 'StudentID': '5',
 '_id': ObjectId('611e5a4e92c2728916f8fb39')}

In [26]:
#create collections/ tables
collection=db.City
collection=db.Country
collection=db.Courses

In [27]:
#Add records to the collection City
cities={"City_Code":"1", 'city_name':'Nairobi'}, {"City_Code":"2",'city_name':'Kampala'}, {"City_Code":"3",'city_name':'Dar es Salam'}
db.City.insert_many(cities)
print('Records saved successfully')

Records saved successfully

In [28]:
#retrieve records saved in City collection
result=db.City.find()
for row in result:
    pprint(row)

{'City_Code': '1',
 '_id': ObjectId('611e5a6b92c2728916f8fb3a'),
 'city_name': 'Nairobi'}
{'City_Code': '2',
 '_id': ObjectId('611e5a6b92c2728916f8fb3b'),
 'city_name': 'Kampala'}
{'City_Code': '3',
 '_id': ObjectId('611e5a6b92c2728916f8fb3c'),
 'city_name': 'Dar es Salam'}

In [29]:
#Add records to the collection Country
countries={"Country_Code":"1", 'Country_Name':'Kenya'}, {"Country_Code":"2", 'Country_Name':'Uganda'}, {"Country_Code":"3",'Country_Name':'Tanzania'}
db.Country.insert_many(countries)
print('Records  saved successfully')

Records  saved successfully

In [30]:
#retrieve saved records in Country
result=db.Country.find()
for row in result:
    pprint(row)

{'Country_Code': '1',
 'Country_Name': 'Kenya',
 '_id': ObjectId('611e5a8292c2728916f8fb3d')}
{'Country_Code': '2',
 'Country_Name': 'Uganda',
 '_id': ObjectId('611e5a8292c2728916f8fb3e')}
{'Country_Code': '3',
 'Country_Name': 'Tanzania',
 '_id': ObjectId('611e5a8292c2728916f8fb3f')}

In [31]:
#Add records to table Courses
course={"CourseID":"1", 'Course_Name':'Engineering'}, {"CourseID":"2", 'Course_Name':'Medicine'}, {"CourseID":"3", 'Course_Name':'Law'}, {"CourseID":"4", 'Course_Name':'Education'}, {"CourseID":"5",'Course_Name':'Arts'}
db.Courses.insert_many(course)
print('Records saved successfully')

Records saved successfully

In [32]:
#retrieve saved records
result=db.Courses.find()
for row in result:
    pprint(row)

{'CourseID': '1',
 'Course_Name': 'Engineering',
 '_id': ObjectId('611e5a9792c2728916f8fb40')}
{'CourseID': '2',
 'Course_Name': 'Medicine',
 '_id': ObjectId('611e5a9792c2728916f8fb41')}
{'CourseID': '3',
 'Course_Name': 'Law',
 '_id': ObjectId('611e5a9792c2728916f8fb42')}
{'CourseID': '4',
 'Course_Name': 'Education',
 '_id': ObjectId('611e5a9792c2728916f8fb43')}
{'CourseID': '5',
 'Course_Name': 'Arts',
 '_id': ObjectId('611e5a9792c2728916f8fb44')}

In [39]:
#display data as dataframes using Pandas library
import pandas as pd

In [42]:
#create a student dataframe
studentdf=pd.DataFrame ([x for x in db.Student.find()])
#set index for the data in dataframe
studentdf.set_index('StudentID', inplace=True)
#remove default_id by the MongoDB
studentdf.drop('_id', inplace = True, axis=1)
#display the student dataframe
studentdf

,First_Name,Last_Name,Email,Cellphone,Physical_Address,Gender,City_Code,Country_Code,CourseID
StudentID,,,,,,,,,
1,Judy,Kimeu,judykimeu10@gmail.com,0205154500,Meru,Female,1,1,2
2,Eric,Lagat,lagateric@gmail.com,0205155500,Baringo,Male,1,1,3
3,Henry,Taute,taute@yahoo.com,0205156500,Homabay,Male,2,2,2
4,Maurine,Njoki,njoki_maurine@hotmail.com,0205157500,Nairobi,Female,3,3,1
5,Fatme,Gatheru,fatme_gatheru@yahoo.com,0205158500,Meru,Female,3,3,4

In [44]:
#create a City dataframe
citydf=pd.DataFrame ([x for x in db.City.find()])
#set index for the data in the dataframe
citydf.set_index("City_Code", inplace = True)
#remove the default ID column by MongoDB
citydf.drop('_id', inplace = True, axis=1)
#Display data
citydf

              city_name
City_Code
1               Nairobi
2               Kampala
3          Dar es Salam

In [45]:
#create the country dataframe
countrydf=pd.DataFrame ([x for x in db.Country.find()])
#set index
countrydf.set_index("Country_Code", inplace= True)
#remove the default ID column by mongoDB
countrydf.drop('_id', inplace= True, axis=1)
#display the formatted data
countrydf

             Country_Name
Country_Code
1                   Kenya
2                  Uganda
3                Tanzania

In [48]:
#Format the data retieved from the Courses collection using pandas
coursesdf=pd.DataFrame ([x for x in db.Courses.find()])
#set index for the data
coursesdf.set_index("CourseID", inplace=True)
#remove the _id column from the presentation
coursesdf.drop("_id", inplace = True, axis=1)
#do data presentation
coursesdf

          Course_Name
CourseID
1         Engineering
2            Medicine
3                 Law
4           Education
5                Arts

In [57]:
#Join the collection to produce data in a single table
#use aggregate function and lookup
join_student_courses= db.Student.aggregate(
[
    {
        "$lookup":{
            "from":"Courses",
            "localField":"CourseID",
            "foreignField":"CourseID",
            "as":"Student_Course"
        }
    },
    #select fields to display from the selction
    {"$unwind":"$Student_Course" },
    {
        "$project":{
            "_id":0,
            "StudentID":1,
            "First_Name":2,
            "Last_Name":3,
            "Gender":4,
            "Course_Name":"$Student_Course.Course_Name"
            
        }
    }
])

#Can present this data usual way not in tabular form
#for x in join_student_courses:
#    print(x)
    
#present the data above in tabular format
studentcoursesdf=pd.DataFrame (list(join_student_courses))
#set index
studentcoursesdf.set_index("StudentID", inplace= True)
#display the table
studentcoursesdf

          First_Name Last_Name  Gender  Course_Name
StudentID
1               Judy     Kimeu  Female     Medicine
2               Eric     Lagat    Male          Law
3              Henry     Taute    Male     Medicine
4            Maurine     Njoki  Female  Engineering
5              Fatme   Gatheru  Female    Education

In [66]:
#join the Students collection to City and Country
#use aggregate function and lookup
join_student_city_country_courses=db.Student.aggregate(
[
    {
        "$lookup":{
            "from":"City",
            "localField":"City_Code",
            "foreignField":"City_Code",
            "as": "student_city"
        }
    },
    {"$unwind":"$student_city"},
    {
        "$lookup":{
            "from":"Country",
            "localField":"Country_Code",
            "foreignField":"Country_Code",
            "as": "student_country"
        }
    },
    {"$unwind":"$student_country"},
    {
        "$lookup":{
            "from":"Courses",
            "localField":"CourseID",
            "foreignField":"CourseID",
            "as": "student_courses"
        }
    },
    {"$unwind":"$student_courses"},
    {
        "$project":{
            "_id":0,
            "StudentID":1,
            "First_Name":2,
            "Last_Name":3,
            "Gender":4,
            "City":"$student_city.city_name",
            "Country_Name":"$student_country.Country_Name",
            "Courses":"$student_courses.Course_Name"
        }
    }
])

#present the data selected from the collections in tabular format using pandas
student_city_country_courses_df=pd.DataFrame (list(join_student_city_country_courses))
#set index
student_city_country_courses_df.set_index("StudentID", inplace= True)
#Display the data
student_city_country_courses_df

          First_Name Last_Name  Gender          City Country_Name      Courses
StudentID
1               Judy     Kimeu  Female       Nairobi        Kenya     Medicine
2               Eric     Lagat    Male       Nairobi        Kenya          Law
3              Henry     Taute    Male       Kampala       Uganda     Medicine
4            Maurine     Njoki  Female  Dar es Salam     Tanzania  Engineering
5              Fatme   Gatheru  Female  Dar es Salam     Tanzania    Education